In [3]:

import pandas as pd
import numpy as np

In [4]:
obj = pd.Series(["a", "a", "b", "c"] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [5]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [6]:
import pickle

In [7]:
myList=['a','b']

In [8]:
with open("pic_ex1.pickle","wb") as f:
    pickle.dump(myList, f)

In [9]:
with open("pic_ex1.pickle","rb") as f:
    myData=pickle.load(f)

In [10]:
myData

['a', 'b']

In [12]:
price=pd.read_pickle("data/examples/yahoo_price.pkl")
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [14]:
volume=pd.read_pickle("data/examples/yahoo_volume.pkl")
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [15]:
volume.to_pickle("pic_ex2.pkl")

In [16]:
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [17]:
returns=price.pct_change()
returns

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
...              ...       ...       ...       ...
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

In [18]:
returns['AAPL'].corr(returns['GOOG'])

0.4079185761679696

In [19]:
returns['AAPL'].corr(returns['MSFT'])

0.38969458628057835

In [20]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [21]:
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [22]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [23]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

In [24]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [25]:
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [26]:
obj.to_numpy()

array(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'], dtype=object)

In [28]:
pd.value_counts(obj.to_numpy())

C:\Users\OH\AppData\Local\Temp\ipykernel_13820\4037610489.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.to_numpy())

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [30]:
pd.value_counts(obj.to_numpy(), sort=False)

C:\Users\OH\AppData\Local\Temp\ipykernel_13820\164454357.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.to_numpy(), sort=False)

c    3
a    3
d    1
b    2
Name: count, dtype: int64

In [31]:
pd.value_counts(obj.to_numpy(), ascending=True)

C:\Users\OH\AppData\Local\Temp\ipykernel_13820\3730876187.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.to_numpy(), ascending=True)

d    1
b    2
c    3
a    3
Name: count, dtype: int64

In [32]:
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [35]:
1 in obj
9 in obj

False

In [36]:
obj[obj.isin(['b','c'])]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [37]:
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])

In [38]:
unique_vals = pd.Series(["c", "b", "a"])

In [39]:
pd.Index(unique_vals)

Index(['c', 'b', 'a'], dtype='object')

In [43]:
indices=pd.Index(unique_vals).get_indexer(to_match)
indices

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [42]:

data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
                     "Qu2": [2, 3, 1, 2, 3],
                     "Qu3": [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [46]:
data['Qu1'].value_counts().sort_index()

Qu1
1    1
3    2
4    2
Name: count, dtype: int64

In [47]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [48]:
data.value_counts()

Qu1  Qu2  Qu3
1    2    1      1
3    2    4      1
     3    5      1
4    1    2      1
     3    4      1
Name: count, dtype: int64

In [49]:
data[:].value_counts().sort_index()

Qu1  Qu2  Qu3
1    2    1      1
3    2    4      1
     3    5      1
4    1    2      1
     3    4      1
Name: count, dtype: int64

In [57]:
# def counting_value(x):
#     return x.value_counts()
# data.apply(counting_value)

In [58]:
import warnings 
warnings.filterwarnings(action='ignore')

In [60]:
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [61]:
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [62]:
data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
Name: count, dtype: int64

In [64]:
df=pd.read_csv('data/examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [65]:
!cat 'data/examples/ex1.csv'

'cat'은(는) 내부 또는 외부 명령, 실행할 수 있는 프로그램, 또는
배치 파일이 아닙니다.

In [67]:
df1=pd.read_csv('data/examples/ex2.csv',header=None)
df1

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [70]:
df=pd.read_csv("data/examples/ex2.csv", header=None, names=['a','b','c','d','msg'], index_col='msg')
df
#index_col : 특정 열의 값을 행 인덱스 라벨로 설정

       a   b   c   d
msg
hello  1   2   3   4
world  5   6   7   8
foo    9  10  11  12

In [73]:
df=pd.read_csv("data/examples/csv_mindex.csv",index_col=['key1','key2'])
df

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [78]:
pd.read_csv("data/examples/ex3.txt", sep="\t") #','로 구분되어있을 떄 사용가능

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [79]:
df=pd.read_csv("data/examples/ex3.txt", sep="\s+") #\s 공백하나, \s 공백 여러개
df

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [80]:
df=pd.read_csv("data/examples/ex4.csv")
df

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [81]:
df=pd.read_csv("data/examples/ex4.csv", skiprows=[0,2,3])
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [87]:
df=pd.read_csv("data/examples/ex5.csv").fillna("NULL")
df=pd.read_csv("data/examples/ex5.csv").fillna("AAA")
df
#fillna는 데이터의 누락값 도는 na등을 읽어올 때 특정 값으로 대체할 때 사용하는 함수

  something  a   b     c   d message
0       one  1   2   3.0   4     AAA
1       two  5   6   AAA   8   world
2     three  9  10  11.0  12     foo

In [89]:
df=pd.read_csv("data/examples/ex5.csv",na_values=["world"])
df
#na_values는 리스트에 담긴 특정 문자열에 해당되는 데이터에 대한 결측값으로 읽어지도록 하는 옵션

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8     NaN
2     three  9  10  11.0  12     foo

In [92]:
# df=pd.read_csv("data/examples/ex5.csv", na_filter=False)
# df

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [94]:
df=pd.read_csv('data/examples/ex5.csv', na_values='one')
df

  something  a   b     c   d message
0       NaN  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [95]:
df=pd.read_csv('data/examples/ex6.csv')
df

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [97]:
df.info

<bound method DataFrame.info of            one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]>

In [118]:
chker=pd.read_csv("data/examples/ex6.csv", chunksize=1000)
type(chker)

pandas.io.parsers.readers.TextFileReader

In [119]:
chker

In [124]:
chker=pd.read_csv("data/examples/ex6.csv", chunksize=1000)
for piece in chker:
    print(piece['key'].value_counts())
    print('='*50)

key
S    48
O    44
F    40
H    39
Q    39
J    39
G    38
R    38
X    37
I    37
V    35
U    33
D    32
E    32
W    31
L    31
K    31
A    30
M    29
Y    28
T    27
N    27
C    27
Z    26
B    25
P    25
7    17
6    17
4    17
3    15
8    13
1    13
2    11
9    11
0     9
5     9
Name: count, dtype: int64
==================================================
key
O    48
L    44
X    40
I    39
R    38
F    37
Q    35
D    34
V    33
K    33
E    32
H    31
J    31
T    31
A    31
U    30
N    30
Z    30
M    28
S    27
Y    27
G    26
P    26
W    25
B    24
C    23
5    20
0    19
9    19
8    19
4    18
1    16
3    16
2    14
6    14
7    12
Name: count, dtype: int64
==================================================
key
A    40
O    40
X    39
E    39
M    38
H    37
T    36
G    36
K    34
L    34
U    33
F    32
B    32
N    31
V    31
S    30
P    30
Z    29
W    29
J    29
D    28
R    28
Q    28
Y    27
C    27
I    25
6    20
0    19
9    19
7    18
3    15
2    14
4    14
8    14
5    14
1    11
Name: count, dtype: int64
==================================================
key
X    43
J    41
V    38
Q    38
D    38
C    37
E    37
N    36
P    35
B    35
F    35
L    33
S    32
K    32
R    31
A    31
M    30
H    30
O    29
Y    28
W    28
I    28
G    27
U    26
Z    24
T    23
5    21
6    18
3    17
1    16
2    16
0    15
9    15
8    13
4    12
7    12
Name: count, dtype: int64
==================================================
key
E    54
Q    42
L    40
H    39
P    38
K    38
M    36
X    35
Y    35
D    34
W    33
U    33
N    33
I    31
T    31
Z    31
F    31
A    31
G    30
B    27
V    26
O    26
C    26
J    25
S    24
2    20
4    18
R    18
0    18
3    18
5    17
6    17
8    16
7    13
9     8
1     8
Name: count, dtype: int64
==================================================
key
Y    42
F    41
K    41
X    38
V    37
L    35
W    35
E    35
J    34
M    33
R    33
P    32
N    32
U    32
I    32
D    31
S    31
B    30
G    28
H    28
Q    27
O    26
A    25
1    25
C    25
T    24
Z    23
5    22
9    20
7    20
6    17
8    17
3    16
4    13
2    12
0     8
Name: count, dtype: int64
==================================================
key
L    41
C    41
Z    39
W    39
X    38
O    37
I    36
T    36
R    35
H    34
J    33
N    32
G    31
D    31
F    31
P    30
E    30
B    30
V    30
U    29
M    29
Q    28
8    25
Y    24
A    23
K    22
7    22
S    21
9    20
0    18
4    18
2    17
1    16
5    15
3    11
6     8
Name: count, dtype: int64
==================================================
key
J    42
M    40
X    39
E    39
D    39
A    38
V    38
G    37
P    35
Q    35
R    34
L    34
H    34
B    34
Y    33
I    33
O    32
U    30
N    29
T    28
K    27
F    26
S    26
C    26
W    25
Z    22
6    21
4    19
8    18
2    16
7    14
0    14
3    13
5    13
1    12
9     5
Name: count, dtype: int64
==================================================
key
O    42
U    41
S    40
A    39
V    37
E    35
T    35
P    35
J    34
K    34
M    34
Q    34
I    33
Z    33
Y    32
W    32
B    32
R    29
F    29
D    28
N    27
X    27
C    26
H    25
L    24
G    24
7    22
4    21
9    18
1    17
2    17
3    15
0    14
6    12
8    12
5    11
Name: count, dtype: int64
==================================================
key
K    42
M    41
U    39
Y    38
P    38
E    35
R    34
Q    34
I    33
T    33
H    33
F    33
B    33
A    32
Z    31
G    31
L    30
N    29
S    29
J    29
C    28
W    28
X    28
3    26
D    25
V    23
6    22
4    21
O    19
0    17
2    15
9    15
8    15
5    15
7    14
1    12
Name: count, dtype: int64
==================================================

In [126]:
tot=pd.Series([], dtype='int64') #빈 시리즈 정의, 정수가 저장될 수 있음
tot

Series([], dtype: int64)

In [125]:
ser1=pd.Series([10,20])
ser1

0    10
1    20
dtype: int64

In [128]:
# tot+ser1
tot.add(ser1, fill_value=0)

0    10.0
1    20.0
dtype: float64

In [142]:
chker=pd.read_csv("data/examples/ex6.csv", chunksize=1000)
tot=pd.Series([], dtype='int64')
for piece in chker:
    first_cnt=piece['key'].value_counts()
    tot=tot.add(first_cnt,fill_value=0)
tot

key
0    151.0
1    146.0
2    152.0
3    162.0
4    171.0
5    157.0
6    166.0
7    164.0
8    162.0
9    150.0
A    320.0
B    302.0
C    286.0
D    320.0
E    368.0
F    335.0
G    308.0
H    330.0
I    327.0
J    337.0
K    334.0
L    346.0
M    338.0
N    306.0
O    343.0
P    324.0
Q    340.0
R    318.0
S    308.0
T    304.0
U    326.0
V    328.0
W    305.0
X    364.0
Y    314.0
Z    288.0
dtype: float64

In [150]:
df=pd.read_csv("data/examples/ex7.csv")
df.values

array([[1, 2, 3],
       [1, 2, 3]], dtype=int64)

In [146]:
import csv

In [149]:
reader=csv.reader(open("data/examples/ex7.csv"))
reader

In [148]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [155]:
 obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [158]:
import json #json은 딕셔너리 형식

In [161]:
res=json.loads(obj)#문자열을 json형식으로 저장
res

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [162]:
asjson=json.dumps(res) # res에 저장된 딕셔너리 구조의 데이터를 문자열로 저장
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [163]:
res['siblings']

[{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
 {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]

In [164]:
pd.DataFrame(res['siblings'])

    name  age            hobbies
0  Scott   34  [guitars, soccer]
1  Katie   42      [diving, art]

In [166]:
data=pd.read_json("data/examples/example.json")
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [167]:
data.to_csv("data_to_csv.csv")

In [168]:
data.to_json

<bound method NDFrame.to_json of    a  b  c
0  1  2  3
1  4  5  6
2  7  8  9>

In [169]:
data.to_json("data_to_json.json")

In [171]:
tables=pd.read_html("data/examples/fdic_failed_bank_list.html")
len(tables)

1

In [175]:
pd.read_excel("data/examples/ex1.xlsx",index_col=0,sheet_name="Sheet1")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [178]:
df=pd.read_excel("data/examples/ex1.xlsx",index_col=0,sheet_name="Sheet2")
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [181]:
df.to_excel("ex1_copy.xlsx",sheet_name="Mysheet1")

In [184]:
pd.read_excel('ex1_copy.xlsx')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo